# Task2
# Реализуйте простой переводчик, который использует словарь для сохранения пар слов.
# Пользователь может вводить слово, а программа возвращает его перевод.
# В этом случае словарь может использоваться для сохранения соответствий между словами на разных языках.
# Пример:
# translations = {
#     'hello': 'привет',
#     'goodbye': 'до свидания',
#     'cat': 'кошка',
#     'dog': 'собака'
# }

d = {'hello': 'привет',
     'goodbye': 'до свидания',
     'cat': 'кошка',
     'dog': 'собака'
     }
print(d['dog'])

